# BuiltInFailures.StructuralLoadFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralLoadFailures Class
BuiltInFailures Class Members See Also
---
Failures about Load.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class StructuralLoadFailures
```

Visual Basic
---
```text
Public NotInheritable Class StructuralLoadFailures
```

Visual C++
---
```text
public ref class StructuralLoadFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..StructuralLoadFailures
# See Also
BuiltInFailures..::..StructuralLoadFailures Members
Autodesk.Revit.DB Namespace